require 'iconv'

a = [1, 2, 3, 5, 4, 7]
p a

[
  ["a\t\t","数组"],
  ["a.length\t","长度"],
  ["a[-1]\t\t","倒数第一个"],
  ["a[10]\t\t","超出数组的长度下标都表示nil"],
  ["a[2,3]\t\t","表示下标从2开始的连续3个数组段"],
  ["a[1..3]\t\t","表示下标从1到下标3的数组段"],
  ["a[1..3]\t\t","表示下标从1到下标2的数组段，不包含最后一个数"],
  ["a.delete_at(0)\t","把第一个元素给删除了"],
  ["a.insert(0, 1)\t","把1插入到数组开始处"],
  ["a.slice!(1, 2)\t","（slice）表示获取下标1开始的2个元素不删除，（slice!）获取完后删除元素"],
  ["a<<7\t\t","添加到数组末尾 同 a.push(7)"],
  ["a.pop(2)\t","删除末尾2个元素  同 a.slice!(-1,2)"],
  ["a.shift(2)\t","删除前面两个元素 同 a.slice!(0,2)"],
  ["a.unshift(1,2)\t","前面插入两个元素 同 a.insert(0, 1,2)"],
  ["a=[0]+a\t\t","[(+ <<,并集包含重复)(|,并集不包含重复)] [&,交集] [-,差集]"],
  ].each { |method|
	puts "#{method[0]}\t#{eval(method[0])}\t\t# #{Iconv.conv("UTF-8","UTF-8",method[1])}"
}
